TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
//TeegyBigz and TerrienDJV5
//tamagotchi_V0.0.0 for Hardware V1
//ESP-Wroom-32

//please View "Helpful-URL-OwO.txt"



#include "FreeRTOSConfig.h" //https://www.freertos.org/a00106.html
#define INCLUDE_eTaskGetState true

#include "esp_attr.h" //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/memory-types.html

/*#################################################*/
//Try This!
//#include "painlessMesh.h" //https://randomnerdtutorials.com/esp-mesh-esp32-esp8266-painlessmesh/

/*#################################################*/


//Define Simple Functions
#define ARRAY_LEN(array) ((sizeof(array))/(sizeof(array[0])))



/*
   Dictionary
   https://github.com/arkhipenko/Dictionary
*/

#define _DICT_CRC_ 32 //choices 16, 32, 64, etc

#define _DICT_PACK_STRUCTURES
//#define _DICT_COMPRESS_SHOCO
//#define _DICT_COMPRESS_SMAZ
#define _DICT_USE_PSRAM  // for ESP32 only


#ifdef _DICT_USE_PSRAM
#define KEYS  10000
#define TESTS 10000
#else
#define KEYS  2000
#define TESTS 10000
#endif

#define _DICT_KEYLEN 64
#define _DICT_VALLEN 256

//#define _DEBUG_
//#define _TEST_

#include <Dictionary.h>


/*
   Dictionary
*/

//Feature Enables (compiler Addons)
#define FeatureEnable_BT_Serial false
#define FeatureEnable_WiFi_Serial true //Option not implemented (enabled or disabled)
#define FeatureEnable_UART_Serial true //Option not implemented (enabled or disabled)

#define FeatureEnable_SH1106_Display true //Option not Fully implemented (enabled or disabled)
#define FeatureEnable_PiSo_Control true //Option not implemented (enabled or disabled)
#define FeatureEnable_WiFiHTTP_Control true //Option not implemented (enabled or disabled)

#define FeatureEnable_IR_RXTX_Control false



//storageDevice modes
#define STORAGE_SELECT_SD 0
#define STORAGE_SELECT_SPIFFS 1
#define STORAGE_SELECT_SDFAT 2
#define STORAGE_SELECT_FFAT 3

#define STORAGE_INCLUDE_SD false
#define STORAGE_INCLUDE_SPIFFS true
#define STORAGE_INCLUDE_SDFAT false
#define STORAGE_INCLUDE_FFAT false

#define STORAGE_DEVICE_DEFAULT 1




//Library startups
#include "Arduino.h"
#include <string>

#include "FS.h"
#include "SPIFFS.h"
//https://www.tutorialspoint.com/esp32_for_iot/esp32_for_iot_spiffs_storage.htm


//Json Support
//<ArduinoJson.h> By Benoit BLANCHON
#include <ArduinoJson.h> //https://arduinojson.org/





//WiFi Support
#include "WiFi.h"
#include <esp_wifi.h>
#include "WiFiType.h"
#include <WiFiMulti.h>
#include <SimpleFTPServer.h> //FTP


WiFiMulti wifiMulti;

//set #define FTP_DEBUG in ESP8266FtpServer.h to see ftp verbose on serial
FtpServer ftpSrv;

// WiFi connect timeout per AP. Increase when connecting takes longer.
const uint32_t connectTimeoutMs = 10000;

int wifi_status = WL_IDLE_STATUS;
WiFiServer SerialWiFiserver(23);

// Initialize the client library
WiFiClient SerialWiFiclient;





//other Stuff Support

#include "time.h"

#include "driver/adc.h"
#include "driver/dac.h"

#include <Preferences.h> 
Preferences preferences;



#include <SPI.h>
#include <Wire.h>



#if (FeatureEnable_SH1106_Display==true)
#include <Adafruit_GFX.h>
#include <Adafruit_SH1106.h>
#include "Taskbar.h"



#include "BMIMGmanipulate.h"
BMIMGmanipulate bitmapIMGmanipulate0(false);



//#define _TEST_ADAFRUIT_SH1106
#ifdef _TEST_ADAFRUIT_SH1106
#include "Test_Adafruit_SH1106.h"
#endif

#endif



#if (FeatureEnable_PiSo_Control==true)
#include "ButtonPISO.h"

#endif



#if (FeatureEnable_BT_Serial==true)
#include "BluetoothSerial.h"

#if !defined(CONFIG_BT_ENABLED) || !defined(CONFIG_BLUEDROID_ENABLED)
#error("Bluetooth is not enabled! Please run `make menuconfig` to and enable it")
#endif
BluetoothSerial SerialBT;
#endif





#if (FeatureEnable_IR_RXTX_Control==true)
/*
   Specify which protocol(s) should be used for decoding.
   If no protocol is defined, all protocols (except Bang&Olufsen) are active.
   This must be done before the #include <IRremote.hpp>
*/
//#define DECODE_DENON        // Includes Sharp
//#define DECODE_JVC
//#define DECODE_KASEIKYO
#define DECODE_PANASONIC    // alias for DECODE_KASEIKYO
//#define DECODE_LG
//#define DECODE_NEC          // Includes Apple and Onkyo
//#define DECODE_SAMSUNG
//#define DECODE_SONY
//#define DECODE_RC5
//#define DECODE_RC6

//#define DECODE_BOSEWAVE
//#define DECODE_LEGO_PF
//#define DECODE_MAGIQUEST
//#define DECODE_WHYNTER
//#define DECODE_FAST

//#define DECODE_DISTANCE_WIDTH // Universal decoder for pulse distance width protocols
//#define DECODE_HASH         // special decoder for all protocols

//#define DECODE_BEO          // This protocol must always be enabled manually, i.e. it is NOT enabled if no protocol is defined. It prevents decoding of SONY!

//#define DEBUG               // Activate this for lots of lovely debug output from the decoders.

//#define RAW_BUFFER_LENGTH  180  // Default is 112 if DECODE_MAGIQUEST is enabled, otherwise 100.

/*
   This include defines the actual pin number for pins like IR_RECEIVE_PIN, IR_SEND_PIN for many different boards and architectures
*/
//#include "PinDefinitionsAndMore.h"
#include <IRremote.hpp> // include the library
//https://github.com/Arduino-IRremote/Arduino-IRremote

#if !defined(RAW_BUFFER_LENGTH)
#  if RAMEND <= 0x4FF || RAMSIZE < 0x4FF
#define RAW_BUFFER_LENGTH  120
#  elif RAMEND <= 0xAFF || RAMSIZE < 0xAFF // 0xAFF for LEONARDO
#define RAW_BUFFER_LENGTH  400 // 600 is too much here, because we have additional uint8_t rawCode[RAW_BUFFER_LENGTH];
#  else
#define RAW_BUFFER_LENGTH  750
#  endif
#endif

#define DISABLE_CODE_FOR_RECEIVER // Disables restarting receiver after each send. Saves 450 bytes program memory and 269 bytes RAM if receiving functions are not used.
//#define SEND_PWM_BY_TIMER         // Disable carrier PWM generation in software and use (restricted) hardware PWM.
//#define USE_NO_SEND_PWM           // Use no carrier PWM, just simulate an active low receiver signal. Overrides SEND_PWM_BY_TIMER definition
#endif


/*
  define pin Input Variables
*/

//IR Pins
#define IR_TX_Pin 27 //GPIO 27
#define IR_RX_Pin 39 //GPIO 39
#define IR_SEND_PIN 27



//MIC Pin
#define MIC_Pin 34 //GPIO 34


//Buzzer Boi Pin
#define buzzerPin 25//GPIO 25 //DAC1

