TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
//BatterySensePin
#define batteryVoltageDivider 36//GPIO 36 //ADC1_CH0



// Define Connections to 74HC165
// PL pin 1
#define BUTTONPISO_PL 32//GPIO 32 //PISO Load
// Q7 pin 7
#define BUTTONPISO_DataIn 35//GPIO 35 //PISO Data
// CP pin 2
#define BUTTONPISO_Clk 33//GPIO 33 //PISO Clock


//I2C Display
#define OLED_SDA 21 //I2C SDA
#define OLED_SCL 22 //I2C SCL

//UART
//U0UXD is generally used to communicate with the ESP32 for programming and during reset/boot.
#define UART0_TX_Pin 1//Used for Programing Board
#define UART0_RX_Pin 3//Used for Programing Board

//U1UXD is unused and can be used for your projects. Some boards use this port for SPI Flash access though!
#define UART1_TX_Pin 10
#define UART1_RX_Pin 9

//U2UXD is unused and can be used for your projects.
#define UART2_TX_Pin 17
#define UART2_RX_Pin 16

//SPI Bus
#define SPI_MoSi_Pin 23
#define SPI_MiSo_Pin 19
#define SPI_SCK_Pin 18
#define SPI_SS_Pin 5



//Devices Setup
#if (FeatureEnable_PiSo_Control==true)
ButtonPISO buttonpiso1(BUTTONPISO_DataIn, BUTTONPISO_Clk, BUTTONPISO_PL);
#endif


Adafruit_SH1106 display(OLED_SDA, OLED_SCL);


#if defined(ESP32)
//#include <HardwareSerial.h>
//HardwareSerial ExtraSerial0(0);//ESP32Serial0
//HardwareSerial ExtraSerial1(1);//ESP32Serial1
//HardwareSerial ExtraSerial2(2);//ESP32Serial2

#endif





#include "LoRa_E220.h"
#define ENABLE_RSSI true
#define FREQUENCY_915
#define E220_22


//https://github.com/xreef/EByte_LoRa_E220_Series_Library


//LoRa_E220 e220ttl(&ExtraSerial2);  // e22 TX e22 RX
LoRa_E220 e220ttl(&Serial2);  // e22 TX e22 RX

//#include "EByte_LoRa_E220_library.h"



//Devices Setup Complete

#define buttonPISOcount 8

//Byjunction
char buttonNameString[buttonPISOcount][7] =
{
  "UP",
  "Start",
  "Select",
  "A",
  "LEFT",
  "DOWN",
  "RIGHT",
  "B"
};

//https://www.alt-codes.net/arrow_alt_codes.php
char* returnButtonName(byte buttonID, byte opMode = 2) {
  /* Using the string table in program memory requires the use of special functions to retrieve the data.
       The strcpy_P function copies a string from program space to a string in RAM ("buffer").
       Make sure your receiving string in RAM  is large enough to hold whatever
       you are retrieving from program space. */
  
  if (buttonID < 0){
    return NULL;
  }
  if (buttonID >= buttonPISOcount){
    return NULL;
  }
  if (buttonID >= 8){
    return NULL;
  }
  #define rBN_BASE false
  #define rBN_DPAD true
  byte buttonDPADorBASE_Mask = 0b01110001;//0 = BASE, 1 = DPAD //order = MSB //(76543210)
  //byte buttonDPAD_MaskIndex[4] = {0, 6, 5, 4};//up, Right, Down, Left
  //byte buttonBASE_MaskIndex[4] = {1, 2, 3, 7};//Start, Select, A, B
  byte buttonID_NibbleMaskIndex[8] = {0, 0, 1, 2, 3, 2, 1, 3};//up, Start, Select, A, Left, Down, Right, B
  char* buttonDPAD_Symbols[2][4+1] = {"↑→↓←", "▲►▼◄"};
  char buttonBASE_Symbols[4+1] = "+-AB";
  //char* button_Symbols[3][4+1] = {"↑→↓←", "▲►▼◄", "+-AB"};
  
  switch (opMode) {
  case 0:
  case 1:
    switch (bitRead(buttonDPADorBASE_Mask, buttonID)) {
      case rBN_BASE:
        return (char*)buttonBASE_Symbols[ buttonID_NibbleMaskIndex[ buttonID ] ];
        break;
      case rBN_DPAD:
        return buttonDPAD_Symbols[ opMode ][ buttonID_NibbleMaskIndex[ buttonID ] ];
        break;
      default:
        return NULL;
        break;
    }
    break;
  case 2:
    return buttonNameString[buttonID];
    break;
  default:
    return NULL;
    break;
  }
}
unsigned int returnButtonID(char* buttonName) {
  for (unsigned int i = 0; i < ARRAY_LEN(buttonNameString); i++) {
    if (buttonNameString[i] == buttonName) {
      return i;
    }
  }

}



#define maxDebugCommandScan 1024

#define maxDebugCommandLength 256
//https://www.arduino.cc/reference/en/language/variables/utilities/progmem/
#include <pgmspace.h>
const char debugCommand_0[] PROGMEM = "";
const char debugCommand_1[] PROGMEM = "";
const char debugCommand_2[] PROGMEM = "";
const char debugCommand_3[] PROGMEM = "";
const char debugCommand_4[] PROGMEM = "";
const char debugCommand_5[] PROGMEM = "";
const char debugCommand_6[] PROGMEM = "";
const char debugCommand_7[] PROGMEM = "";
const char debugCommand_8[] PROGMEM = "";
const char debugCommand_9[] PROGMEM = "";
const char debugCommand_10[] PROGMEM = "";
const char debugCommand_11[] PROGMEM = "";
const char debugCommand_12[] PROGMEM = "";
const char debugCommand_13[] PROGMEM = "";
const char debugCommand_14[] PROGMEM = "";
const char debugCommand_15[] PROGMEM = "";
const char debugCommand_16[] PROGMEM = "";
const char debugCommand_17[] PROGMEM = "";
const char debugCommand_18[] PROGMEM = "";
const char debugCommand_19[] PROGMEM = "";
const char debugCommand_20[] PROGMEM = "";
const char debugCommand_21[] PROGMEM = "";
const char debugCommand_22[] PROGMEM = "";
const char debugCommand_23[] PROGMEM = "";
const char debugCommand_24[] PROGMEM = "";
const char debugCommand_25[] PROGMEM = "";
const char debugCommand_26[] PROGMEM = "";
const char debugCommand_27[] PROGMEM = "";
const char debugCommand_28[] PROGMEM = "";
const char debugCommand_29[] PROGMEM = "";
const char debugCommand_30[] PROGMEM = "";
const char debugCommand_31[] PROGMEM = "";

// Then set up a table to refer to your strings.
const char* const debugCommand_List[] PROGMEM = {debugCommand_0, debugCommand_1, debugCommand_2, debugCommand_3, debugCommand_4, debugCommand_5, debugCommand_6, debugCommand_7, debugCommand_8, debugCommand_9, debugCommand_10, debugCommand_11, debugCommand_12, debugCommand_13, debugCommand_14, debugCommand_15, debugCommand_16, debugCommand_17, debugCommand_18, debugCommand_19, debugCommand_20, debugCommand_21, debugCommand_22, debugCommand_23, debugCommand_24, debugCommand_25, debugCommand_26, debugCommand_27, debugCommand_28, debugCommand_29, debugCommand_30, debugCommand_31};

char debugCommandBuffer[maxDebugCommandLength];    // make sure this is large enough for the largest string it must hold







#if (FeatureEnable_SH1106_Display==true)
#if (SH1106_LCDHEIGHT != 64)
#error("Height incorrect, please fix Adafruit_SH1106.h!");
#endif
#endif



