TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
/*

   End of Sprites Sheet and Tiles Sheet

*/








/*
 * showPrePrint (Can Be used anyWhere!)
 */
void showPrePrint(Stream &serialport, char* textInput){
  const unsigned int prePrintSize = 32;
  char *prePrintText;
  prePrintText = (char*)malloc(prePrintSize+1);
  memset(prePrintText, '\0', prePrintSize+1);
  if (strlen(textInput) >= prePrintSize){
    strncpy(prePrintText, textInput, prePrintSize);
  }else{
    strncpy(prePrintText, textInput, strlen(textInput));
  }
  serialport.print( prePrintText );
  free(prePrintText);
}



/*
 * WiFi Stuff Start
 */


IPAddress ip(192, 168, 0, 50);
IPAddress gateway(192, 168, 0, 1);
IPAddress subnet(255, 255, 255, 0);

IPAddress local_IP(192, 168, 4, 22);
IPAddress local_gateway(192, 168, 4, 9);
IPAddress local_subnet(255, 255, 255, 0);


unsigned int countNewLinesFromFile(const char *filePath, fs::FS &fs){
  // Open file for reading
  File file = fs.open(filePath, FILE_READ);
  unsigned int newLineCount = 0;
  while(file.available()){
    newLineCount += (file.read()=='\n');
  }
  file.close();
  return newLineCount;
}


typedef struct {
  //six characters are not allowed (SSID): ?, ", $, [, \, ], and +
  char ssid[33];//max length 32 //Min Length 2
  char pass[64];//max length 63
} Credentials_WiFi_Struct;


typedef struct {
  unsigned int length;
  Credentials_WiFi_Struct *credentials;
} List_WiFi_Credentials_Struct;




//https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/wifi-security.html


const char *filenameWiFi = "/Wifi_Connections.json";
List_WiFi_Credentials_Struct wifiCredentialList;
//make Functions that convert Json to Structs


void disable_STA_WiFi();
void enable_STA_WiFi();




void loadWiFiConfigurationCharArray(char jsonChar[], size_t jsonCharSize, Credentials_WiFi_Struct &wifiCredentials);


// Loads the configuration from a charArray
void loadWiFiConfigurationCharArray(char jsonChar[], size_t jsonCharSize, Credentials_WiFi_Struct &wifiCredentials) {
  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use https://arduinojson.org/v6/assistant to compute the capacity.
  StaticJsonDocument<128> connection;

  // Deserialize the JSON document
  DeserializationError error = deserializeJson(connection, jsonChar);
  if (error)
    Serial.println(F("Failed to read JsonCharArray, using default configuration"));

  // Copy values from the JsonDocument to the Config
  strlcpy(wifiCredentials.pass,                  // <- destination
          connection["pass"] | "",  // <- source
          sizeof(wifiCredentials.pass));         // <- destination's capacity
  strlcpy(wifiCredentials.ssid,                  // <- destination
          connection["ssid"] | "",  // <- source
          sizeof(wifiCredentials.ssid));         // <- destination's capacity
  ;
}


//https://jraleman.medium.com/c-programming-language-functions-malloc-calloc-realloc-and-free-61cfc3e45da7

void saveWiFicredentials(Credentials_WiFi_Struct &wifiCredentials);


//to make Reading and writeing faster checkt this out 
//https://github.com/bblanchon/ArduinoStreamUtils

bool ensureValid_Credentials(Credentials_WiFi_Struct &wifiCredential);
bool ensureValid_SSID(Credentials_WiFi_Struct &wifiCredential);
bool ensureValid_PASS(Credentials_WiFi_Struct &wifiCredential);
bool ensureValid_SSIDchar(char* inputSSID);//Make Private if put in a Class!
bool ensureValid_PASSchar(char* inputPASS);//Make Private if put in a Class!


void saveWiFiCredentialsList(const char *filename, const List_WiFi_Credentials_Struct &wifiCredentialList, fs::FS &fs);
void loadWiFiCredentialsList(const char *filename, List_WiFi_Credentials_Struct &wifiCredentialList, fs::FS &fs);
void saveWiFiCredentialToWiFiCredentialsList(List_WiFi_Credentials_Struct &wifiCredentialList, Credentials_WiFi_Struct &wifiCredential);
void remove_WiFiCredential_From_WiFiCredentialsList(List_WiFi_Credentials_Struct &wifiCredentialList, Credentials_WiFi_Struct &wifiCredential);



// Saves the CredentialsList to a file
void saveWiFiCredentialsList(const char *filename, const List_WiFi_Credentials_Struct &wifiCredentialList, fs::FS &fs) {
  Serial.println("File Will Be Saved!");
  File file;
  //fs.remove(filename);// Delete existing file, otherwise the configuration is appended to the file
  file = fs.open(filename, FILE_WRITE);// Open file for writing
  
  if (!file) {
    Serial.println(F("Failed to create file"));
    return;
  }
  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use https://arduinojson.org/assistant to compute the capacity.
  DynamicJsonDocument credentialList(128 * wifiCredentialList.length);
  credentialList[ "Length" ] = wifiCredentialList.length;
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("index: ");Serial.println(index);
    // Set the values in the document
    credentialList["info"][ index ]["ssid"] = wifiCredentialList.credentials[ index ].ssid;
    credentialList["info"][ index ]["pass"] = wifiCredentialList.credentials[ index ].pass;
    Serial.print("ssid: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("pass: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
  }
  serializeJson(credentialList, file);
  serializeJson(credentialList, Serial);
  Serial.println();
  
  // Close the file
  file.close();
}

// Loads the CredentialsList from a file
void loadWiFiCredentialsList(const char *filename, List_WiFi_Credentials_Struct &wifiCredentialList, fs::FS &fs) {
  File file;
  file = fs.open(filename, FILE_READ);// Open file for writing
  Serial.println("File Has Been Read");
  if (!file) {
    Serial.println(F("Failed to create file"));
    return;
  }
  //DynamicJsonDocument credentialList(file.available()*2);
  DynamicJsonDocument credentialList(file.size()*2);
  Serial.println("DynamicJsonDocument");
  //StaticJsonDocument<1024> credentialList;
  //DynamicJsonDocument credentialList(128 * wifiCredentialList.length);
  deserializeJson(credentialList, file);
  Serial.println("deserializeJson");
  
  
  wifiCredentialList.length = credentialList[ "Length" ];
  Serial.println("Length");
  wifiCredentialList.credentials = (Credentials_WiFi_Struct*)calloc(wifiCredentialList.length, sizeof(Credentials_WiFi_Struct));
  Serial.print("length: ");Serial.println(wifiCredentialList.length);
  Serial.println("calloc");
  Credentials_WiFi_Struct temp_wifiCredential;
  unsigned int indexACC = 0;
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("index: ");Serial.println(index);
    // Set the values from the document
    strlcpy(temp_wifiCredential.ssid,                  // <- destination
          credentialList["info"][ index ]["ssid"],  // <- source
          sizeof(temp_wifiCredential.ssid));         // <- destination's capacity
    strlcpy(temp_wifiCredential.pass,                  // <- destination
          credentialList["info"][ index ]["pass"],  // <- source
          sizeof(temp_wifiCredential.pass));         // <- destination's capacity
    
    if ( ensureValid_Credentials( temp_wifiCredential ) == false){
      wifiCredentialList.length -= 1;
      continue;
    }
    // Set the values from the document
    strlcpy(wifiCredentialList.credentials[ indexACC ].ssid,                  // <- destination
          credentialList["info"][ index ]["ssid"],  // <- source
          sizeof(wifiCredentialList.credentials[ indexACC ].ssid));         // <- destination's capacity
    strlcpy(wifiCredentialList.credentials[ indexACC ].pass,                  // <- destination
          credentialList["info"][ index ]["pass"],  // <- source
          sizeof(wifiCredentialList.credentials[ indexACC ].pass));         // <- destination's capacity
    Serial.print("ssid: ");Serial.println(wifiCredentialList.credentials[ indexACC ].ssid);
    Serial.print("pass: ");Serial.println(wifiCredentialList.credentials[ indexACC ].pass);
    indexACC++;
  }
  // Close the file
  file.close();
  
  
  //Check if SSID And PASS are Valid
  Serial.println("Checking if Valid!");
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("SSID: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("PASS: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
  }
  bool credentialsChanged = false;
  for (int index = 0; index < wifiCredentialList.length; index++) {
    if ( ensureValid_Credentials( wifiCredentialList.credentials[ index ] ) ){
      continue;
    }
    credentialsChanged = true;
    remove_WiFiCredential_From_WiFiCredentialsList(wifiCredentialList, wifiCredentialList.credentials[ index ]);
  }
  Serial.println("Checking if Valid!");
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("SSID: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("PASS: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
  }
  if (credentialsChanged){
    //resaves changed CredentialsList by removing inValided Credentials
    saveWiFiCredentialsList(filename, wifiCredentialList, fs);
  }
}


void saveWiFiCredentialToWiFiCredentialsList(List_WiFi_Credentials_Struct &wifiCredentialList, Credentials_WiFi_Struct &wifiCredential) {
  Serial.println("saveWiFiCredentialToWiFiCredentialsList()");
  //Fix Me?
  bool isINList = false;
  for (int index = 0; index < wifiCredentialList.length; index++) {
    if (strcmp(wifiCredentialList.credentials[ index ].ssid, wifiCredential.ssid)==0){
      strlcpy(wifiCredentialList.credentials[ index ].pass,                  // <- destination
          wifiCredential.pass,  // <- source
          sizeof(wifiCredentialList.credentials[ index ].pass));         // <- destination's capacity
      isINList = true;
      break;
    }
  }
  Serial.print("isINList: ");Serial.println(isINList);
  if (isINList){
    return;
  }
  Credentials_WiFi_Struct *tempCredentials;
  tempCredentials = (Credentials_WiFi_Struct*)calloc(wifiCredentialList.length, sizeof(Credentials_WiFi_Struct));
  for (int index = 0; index < wifiCredentialList.length; index++) {
    strcpy(tempCredentials[ index ].ssid, wifiCredentialList.credentials[ index ].ssid);
    strcpy(tempCredentials[ index ].pass, wifiCredentialList.credentials[ index ].pass);
  }
  Serial.println("Relocating og List");
  wifiCredentialList.length += 1;
  free(wifiCredentialList.credentials);
  wifiCredentialList.credentials = (Credentials_WiFi_Struct*)calloc(wifiCredentialList.length, sizeof(Credentials_WiFi_Struct));
  Serial.println("malloc/calloc/realloc og List Complete");
  for (int index = 0; index < (wifiCredentialList.length - 1); index++) {
    strcpy(wifiCredentialList.credentials[ index ].ssid, tempCredentials[ index ].ssid);
    strcpy(wifiCredentialList.credentials[ index ].pass, tempCredentials[ index ].pass);
  }
  Serial.println("adding New index!");
  strcpy(wifiCredentialList.credentials[ wifiCredentialList.length-1 ].ssid, wifiCredential.ssid);
  strcpy(wifiCredentialList.credentials[ wifiCredentialList.length-1 ].pass, wifiCredential.pass);
  free(tempCredentials);
}



void remove_WiFiCredential_From_WiFiCredentialsList(List_WiFi_Credentials_Struct &wifiCredentialList, Credentials_WiFi_Struct &wifiCredential) {
  Serial.println("remove_WiFiCredential_From_WiFiCredentialsList()");
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("SSID: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("PASS: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
  }
  Serial.println("Remove");
  Serial.print("SSID: ");Serial.println(wifiCredential.ssid);
  Serial.print("PASS: ");Serial.println(wifiCredential.pass);
  //will remove saved "WiFiCredential" if ssid is on the List!
  bool isINList = false;
  unsigned int selectIndex = 0;
  for (unsigned int index = 0; index < wifiCredentialList.length; index++) {
    if (wifiCredentialList.credentials[ index ].ssid == wifiCredential.ssid){
      isINList = true;
      selectIndex = index;
      break;
    }
  }
  Serial.print("isINList: ");Serial.println(isINList);
  if (!isINList){
    return;
  }
  Serial.println("removing Selected index!");
  //strcpy(wifiCredentialList.credentials[ selectIndex ].ssid, "");
  //strcpy(wifiCredentialList.credentials[ selectIndex ].pass, "");
  wifiCredentialList.length -= 1;
  
