TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  //Reallocate by making a temp Array of the new size add all the Saved Credentials to that, then call calloc on "wifiCredentialList.credentials" and re-add the Credentials from the Temp Array
  Serial.println("Relocating og List");
  Credentials_WiFi_Struct *tempList;
  tempList = (Credentials_WiFi_Struct*)calloc(wifiCredentialList.length, sizeof(Credentials_WiFi_Struct));
  
  Serial.println("malloc/calloc/realloc og List Complete");
  Serial.println("Populate Resize List!");
  //bug: results in all saved Credentials to be removed if one is invalid! (Status : Fixed)
  //Finish me!
  unsigned int indexoffset = 0;
  for (unsigned int index = 0; index < (wifiCredentialList.length+1); index++) {
    Serial.print("indexoffset:");Serial.println( indexoffset );
    Serial.print("index:");Serial.println( index );
    if ( wifiCredentialList.credentials[ index ].ssid != wifiCredential.ssid ){
      Serial.println("NotEqual");
      //Fix Me!
      strcpy(tempList[ indexoffset ].ssid, wifiCredentialList.credentials[ index ].ssid);
      strcpy(tempList[ indexoffset ].pass, wifiCredentialList.credentials[ index ].pass);
      Serial.println(tempList[ indexoffset ].ssid);
      Serial.println(tempList[ indexoffset ].pass);
      Serial.println(wifiCredentialList.credentials[ index ].ssid);
      Serial.println(wifiCredentialList.credentials[ index ].pass);
      indexoffset++;
    }
  }
  free(wifiCredentialList.credentials);
  wifiCredentialList.credentials = (Credentials_WiFi_Struct*)calloc(wifiCredentialList.length, sizeof(Credentials_WiFi_Struct));
  for (unsigned int index = 0; index < (wifiCredentialList.length); index++) {
    ;
  }
  
  for (int index = 0; index < wifiCredentialList.length; index++) {
    Serial.print("SSID: ");Serial.println(wifiCredentialList.credentials[ index ].ssid);
    Serial.print("PASS: ");Serial.println(wifiCredentialList.credentials[ index ].pass);
  }
  
  
}



bool ensureValid_Credentials(Credentials_WiFi_Struct &wifiCredential){
  //later make "ensureValid_SSID" and "ensureValid_PASS" use (Credentials_WiFi_Struct &wifiCredential) as input
  return ( ensureValid_SSID( wifiCredential ) and ensureValid_PASS( wifiCredential ) );
}

bool ensureValid_SSID(Credentials_WiFi_Struct &wifiCredential){
  return ensureValid_SSIDchar( wifiCredential.ssid );
}
bool ensureValid_PASS(Credentials_WiFi_Struct &wifiCredential){
  return ensureValid_PASSchar( wifiCredential.pass );
}

bool ensureValid_SSIDchar(char* inputSSID){
  //https://routersecurity.org/SSID.php
  //https://www.cisco.com/assets/sol/sb/WAP321_Emulators/WAP321_Emulator_v1.0.0.3/help/Wireless05.html
  
  unsigned int inputSSIDLen = strlen(inputSSID);
  //The SSID can be any alphanumeric, case-sensitive entry from 2 to 32 characters.
  if ((inputSSIDLen>32)or(inputSSIDLen<2)){
    Serial.println("Returning False!");
    return false;
  }
  // In addition, these three characters cannot be the first character:!, #, and ; (ASCII 0x21, 0x23, and 0x3B, respectively).
  if ( (inputSSID[ 0 ] == 0x21)or(inputSSID[ 0 ] == 0x23)or(inputSSID[ 0 ] == 0x3B) ){
    Serial.println("Returning False!");
    return false;
  }
  //Trailing and leading spaces (ASCII 0x20) are not permitted.
  //NOTE     This means that spaces are allowed within the SSID, but not as the first or last character, and the period “.” (ASCII 0x2E) is also allowed. 
  if ( (inputSSID[ 0 ] == 0x20)or(inputSSID[ inputSSIDLen-1 ] == 0x20) ){
    Serial.println("Returning False!");
    return false;
  }
  char blackListChar[7] = {'?', '"', '$', '[', '\\', ']', '+'};//0x3F, 0x22, 0x24, 0x5B, 0x5C, 0x5D, 0x2B
  char blackListCharHex[7] = {0x3F, 0x22, 0x24, 0x5B, 0x5C, 0x5D, 0x2B};
  for (unsigned int index = 0; index < inputSSIDLen; index++) {
    Serial.print("CharIndex: ");Serial.println(inputSSID[ index ]);
    // The allowable characters are: ASCII 0x20, 0x21, 0x23, 0x25 through 0x2A, 0x2C through 0x3E, 0x40 through 0x5A, 0x5E through 0x7E.
    if (not ( (inputSSID[ index ] == 0x20)or(inputSSID[ index ] == 0x21)or(inputSSID[ index ] == 0x23)or(isCharRange(inputSSID[ index ], 0x25, 0x2A))or(isCharRange(inputSSID[ index ], 0x2C, 0x3E))or(isCharRange(inputSSID[ index ], 0x40, 0x5A))or(isCharRange(inputSSID[ index ], 0x5E, 0x7E)) ) ){
      Serial.println("Returning False!");
      return false;
    }
    //The printable characters plus the space (ASCII 0x20) are allowed, but these six characters are not: ?, ", $, [, \, ], and +.
    //{'?', '"', '$', '[', '\\', ']', '+'} == {0x3F, 0x22, 0x24, 0x5B, 0x5C, 0x5D, 0x2B}
    if (inputSSID[ index ] == 0x3F){
      Serial.println("Returning False!");
      Serial.print("inputSSID[ index ]: ");Serial.println(inputSSID[ index ], HEX);
      return false;
    }
    if (inputSSID[ index ] == 0x22){
      Serial.println("Returning False!");
      Serial.print("inputSSID[ index ]: ");Serial.println(inputSSID[ index ], HEX);
      return false;
    }
    if (inputSSID[ index ] == 0x24){
      Serial.println("Returning False!");
      Serial.print("inputSSID[ index ]: ");Serial.println(inputSSID[ index ], HEX);
      return false;
    }
    if (inputSSID[ index ] == 0x5B){
      Serial.println("Returning False!");
      Serial.print("inputSSID[ index ]: ");Serial.println(inputSSID[ index ], HEX);
      return false;
    }
    if (inputSSID[ index ] == 0x5C){
      Serial.println("Returning False!");
      Serial.print("inputSSID[ index ]: ");Serial.println(inputSSID[ index ], HEX);
      return false;
    }
    if (inputSSID[ index ] == 0x5D){
      Serial.println("Returning False!");
      Serial.print("inputSSID[ index ]: ");Serial.println(inputSSID[ index ], HEX);
      return false;
    }
    if (inputSSID[ index ] == 0x2B){
      Serial.println("Returning False!");
      Serial.print("inputSSID[ index ]: ");Serial.println(inputSSID[ index ], HEX);
      return false;
    }
    /*
    for (unsigned int indexCheck = 0; indexCheck < 7; indexCheck++) {
      Serial.print("indexCheck: ");Serial.print(indexCheck);
      Serial.print(", ");
      Serial.print("CharCheck: ");Serial.println(blackListChar[indexCheck]);
      Serial.print("CharCheckHex: ");Serial.println(blackListCharHex[indexCheck]);
      if (inputSSID[ index ] == blackListChar[indexCheck]){
        Serial.println("Returning False!");
        return false;
      }
    }
    //*/
    
