TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
    image_size = structDIB_header.image_size;
    bitmapIMG.widthPx = structDIB_header.bitmapPixelWidth;
    bitmapIMG.heightPx = structDIB_header.bitmapPixelHeight;
    switch (structDIB_header.pixelBitWidth) {
      case 1:
        bitmapIMG.imageByteLength = (bitmapIMG.widthPx * bitmapIMG.heightPx) >> 3;//">>3" divides by 8
        break;
    }
    
    break;
  }
  free(raw_DIB_Header);
  
  
  
  (void)fileBMP.seek(pixelArrayOffset);
  unsigned char* raw_Pixel_Array;
  raw_Pixel_Array = (unsigned char*)malloc(structDIB_header.image_size + 1);
  fileBMP.read(raw_Pixel_Array, structDIB_header.image_size);
  
  bitmapIMG.image = (unsigned char*)malloc(bitmapIMG.imageByteLength);
  for (int index = 0; index < bitmapIMG.imageByteLength; index++) {
    bitmapIMG.image[index] = 0;
  }
  unsigned int indexBit = 0;
  for (int indexH = 0; indexH < structDIB_header.bitmapPixelHeight; indexH++) {
    for (int indexW = 0; indexW < structDIB_header.bitmapPixelWidth; indexW++) {
      for (int indexF = 0; indexF < structDIB_header.pixelBitWidth; indexF++) {
        ;
      }
      unsigned int index = (indexW * indexH)>>3;
      bitmapIMG.image[index] = raw_Pixel_Array[indexBit>>3];
      indexBit = indexBit + structDIB_header.pixelBitWidth;
    }
    indexBit = indexBit + (structDIB_header.bitmapPixelWidth * structDIB_header.pixelBitWidth)%32;//skip over Row Padding
  }
  free(raw_Pixel_Array);
  
  //finish Me and test Me
  
  
}


void load_struct_bitmapIMG_dat_File(File &fileBMP, IMGbitmapStruct &bitmapIMG);
void display_struct_bitmapIMG(Adafruit_SH1106 &display, IMGbitmapStruct &bitmapIMG, int locx, int locy);






/* Sorce: https://forum.arduino.cc/t/passing-struct-info-as-function-parameters/37330/2
    Sorce: https://forum.arduino.cc/t/passing-struct-info-as-function-parameters/37330/7
   The "&" effectively means that the original will be operated on rather than a copy that only exists in the scope of the function.
   References are a less powerful but far easier to use derivative of pointers, Google should find more about them if you want to know.
*/
void load_struct_bitmapIMG_dat_File(File &fileBMP, IMGbitmapStruct &bitmapIMG) {
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  //→ used for struct pointer
  //Serial.println(fileBMP.seek(0));
  bitmapIMG.imageByteLength = ((fileBMP.read()) << 8) | (fileBMP.read());
  bitmapIMG.widthPx = ((fileBMP.read()) << 8) | (fileBMP.read());
  bitmapIMG.widthPx++;
  bitmapIMG.imageByteLength -= 2;
  bitmapIMG.heightPx = ((fileBMP.read()) << 8) | (fileBMP.read());
  bitmapIMG.heightPx++;
  bitmapIMG.imageByteLength -= 2;
  unsigned char* imageTemp;
  imageTemp = (unsigned char*)malloc(bitmapIMG.imageByteLength + 1);
  bitmapIMG.image = (unsigned char*)malloc(bitmapIMG.imageByteLength);
  fileBMP.read(imageTemp, bitmapIMG.imageByteLength);
  for (int index = 0; index < bitmapIMG.imageByteLength; index++) {
    bitmapIMG.image[index] = imageTemp[index];
  }
  free(imageTemp);
}


void display_struct_bitmapIMG(Adafruit_SH1106 &display, IMGbitmapStruct &bitmapIMG, int locx, int locy) {
  display.drawBitmap(locx, locy, bitmapIMG.image, bitmapIMG.widthPx, bitmapIMG.heightPx, WHITE);
}


typedef struct {
  int x;
  int y;
  int z;
} Position3D_int_Struct;

typedef struct {
  long x;
  long y;
  long z;
} Position3D_long_Struct;

typedef struct {
  int x;
  int y;
} Position2D_int_Struct;

typedef struct {
  long x;
  long y;
} Position2D_long_Struct;




typedef struct {
  //uint16_t locxPxOffset = 0; //X Offset in pixels
  //uint16_t locyPxOffset = 0; //Y Offset in pixels
  Position2D_int_Struct locPxOffset;//X&Y Offset in pixels
  uint16_t widthPx;//in pixels(Global)
  uint16_t heightPx;//in pixels(Global)
  
  
  //subframeDataRotation is used if "rotationSFCompression" is Enabled
  uint8_t subframeDataRotation = 0; //data rotated Clockwise 4 phases
  /* subframeDataRotation
     0 == 0 CW rotations Needed
     1 == 3 CW rotations Needed
     2 == 2 CW rotations Needed
     3 == 1 CW rotations Needed
  */
  unsigned int frameStaydelayms = 100;// units = milliseconds
  uint16_t frameByteLength;//frame data byteSize
  unsigned char* frameDataPool;//size is gifByteLength
  unsigned long lastMillisecTime = 0;
} GIFframebitmapStruct;


typedef struct {
  //https://www.tutorialspoint.com/structs-in-arduino-program
  char imageName[32] = "GIF";//max name length = 31 charaters
  uint16_t gifByteLength;//total image byteSize
  uint16_t frameCount;
  GIFframebitmapStruct *subFramePointers;//[frameCount]
  uint16_t globalsubimageByteLength;
  uint16_t widthGPx;//in pixels(Global)
  uint16_t heightGPx;//in pixels(Global)
  
  byte subframeCompressionFlags;//size is frameCount //8 flags each frame
  bool cropSFCompression = false;
  bool rotationSFCompression = false;
  
  unsigned long lastMillisecTime = 0;
} GIFbitmapStruct;





void load_struct_bitmapGIF_dat_File(File &file, GIFbitmapStruct &bitmapGIF);
void display_struct_bitmapGIF(Adafruit_SH1106 &display, GIFbitmapStruct &bitmapGIF, int frame, int locx, int locy);



void load_struct_bitmapGIF_dat_File(File &file, GIFbitmapStruct &bitmapGIF) {
  Serial.println("load_struct_bitmapGIF_dat_File");
  if (!file) {
    Serial.println("Failed to open file for reading");
    return;
  }
  printFreeHeap(Serial);
  unsigned long filesize = file.size();
  //→ used for struct pointer
  //check first 2 bytes, if they are not 0 then its the old formating
  bool formatCheck;
  char* checkHeaderFormat;
  checkHeaderFormat = (char*)malloc(7);
  memset(checkHeaderFormat, '\0', 7);
  file.seek(0);
  checkHeaderFormat[0] = (char)file.peek();
  file.seek(1);
  checkHeaderFormat[1] = (char)file.peek();
  file.seek(2);
  checkHeaderFormat[2] = (char)file.peek();
  file.seek(3);
  checkHeaderFormat[3] = (char)file.peek();
  file.seek(4);
  checkHeaderFormat[4] = (char)file.peek();
  file.seek(5);
  checkHeaderFormat[5] = (char)file.peek();
  file.seek(0);
  if (strncpy(checkHeaderFormat, "datgif", 6) == 0) {
    formatCheck = true;
  } else {
    formatCheck = false;
  }


  unsigned char* imageTemp;

  unsigned int gifdataReadIndex = 0;
  unsigned int imagedataSize = 0;
  Serial.println("load_struct_bitmapGIF_dat_File -Check -00");
  printFreeHeap(Serial);
  if (formatCheck == false) {
    Serial.println("load_struct_bitmapGIF_dat_File -Check -01");
    //old format
    //2 bytes - subframeDataSize (includes subframe variables)
    //2 bytes - subframeWidth         (if "enabled") (cropSFCompression OR rotationSFCompression)
    //2 bytes - subframeHeight        (if "enabled") (cropSFCompression OR rotationSFCompression)
    //# bytes - frameData (byte size = subframeDataSize)
    //repeat until end of File
    unsigned int frameIndex = 0;

