TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
    unsigned int frameDataSize;
    file.seek(0);
    frameDataSize = ((file.read()) << 8) | (file.read());
    file.seek(0);

    printFreeHeap(Serial);
    bitmapGIF.frameCount = int(filesize / (frameDataSize + 2));
    //bitmapGIF.frameDataPool = (unsigned char*)malloc(bitmapGIF.frameCount*(frameDataSize-2-2));
    Serial.print("bitmapGIF.frameDataPool: "); Serial.println( bitmapGIF.frameCount * (frameDataSize - 2 - 2) );


    //bitmapGIF.subFramePointers = (GIFframebitmapStruct*)malloc(bitmapGIF.frameCount);//Check This
    bitmapGIF.subFramePointers = (GIFframebitmapStruct*)malloc(bitmapGIF.frameCount*32);
    
    
    //bitmapGIF.subimageByteOffset = (uint16_t*)malloc(bitmapGIF.frameCount);
    //bitmapGIF.frameStaydelayms = (unsigned int*)malloc(bitmapGIF.frameCount);
    bitmapGIF.subframeCompressionFlags = 0b00000000;
    Serial.println("load_struct_bitmapGIF_dat_File -Check -02");
    gifdataReadIndex = 0;
    bitmapGIF.gifByteLength = 0;
    frameIndex = 0;
    while (file.available()) {
      Serial.print("load_struct_bitmapGIF_dat_File -Check -03 -"); Serial.println(frameIndex);
      bitmapGIF.subFramePointers[ frameIndex ].frameByteLength = ((file.read()) << 8) | (file.read());
      bitmapGIF.subFramePointers[ frameIndex ].widthPx = ((file.read()) << 8) | (file.read());
      bitmapGIF.subFramePointers[ frameIndex ].widthPx++;
      bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
      bitmapGIF.subFramePointers[ frameIndex ].heightPx = ((file.read()) << 8) | (file.read());
      bitmapGIF.subFramePointers[ frameIndex ].heightPx++;
      bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
      Serial.println("load_struct_bitmapGIF_dat_File -Check -04");
      printFreeHeap(Serial);

      bitmapGIF.subFramePointers[ frameIndex ].frameDataPool = (unsigned char*)malloc(bitmapGIF.subFramePointers[ frameIndex ].frameByteLength);
      file.read(bitmapGIF.subFramePointers[ frameIndex ].frameDataPool, bitmapGIF.subFramePointers[ frameIndex ].frameByteLength);
      bitmapGIF.subFramePointers[ frameIndex ].locPxOffset.x = 0;
      bitmapGIF.subFramePointers[ frameIndex ].locPxOffset.y = 0;
      display.clearDisplay();
      display.drawBitmap(0, 0, bitmapGIF.subFramePointers[ frameIndex ].frameDataPool, bitmapGIF.subFramePointers[ frameIndex ].widthPx, bitmapGIF.subFramePointers[ frameIndex ].heightPx, WHITE);
      display.display();

      Serial.println("load_struct_bitmapGIF_dat_File -Check -05");

      printFreeHeap(Serial);
      bitmapGIF.subFramePointers[ frameIndex ].frameStaydelayms = 1;
      gifdataReadIndex += bitmapGIF.globalsubimageByteLength;
      bitmapGIF.gifByteLength += bitmapGIF.globalsubimageByteLength;

      frameIndex++;
    }
    frameIndex--;
    Serial.print("frameIndex: "); Serial.println(frameIndex);
  }
  if (formatCheck == true) {
    /*needs to be tested*/
    //format of .datgif
    //6 bytes - Fileheader ("datgif")
    //2 bytes - FileheaderVersion ("00")
    //2 byte  - frameCount
    //1 byte  - subframe Compression Flags (8 flags) = {cropSFCompression, rotationSFCompression, unused, unused, unused, unused, unused, unused}
    //2 bytes - GlobalsubframeDataSize
    //2 bytes - globalframeWidth
    //2 bytes - globalframeHeight


    //subframes
    //2 bytes - subframeDataSize (if "enabled") (cropSFCompression OR rotationSFCompression)(includes subframe variables)
    //2 bytes - subframeWidth         (if "enabled") (cropSFCompression OR rotationSFCompression)
    //2 bytes - subframeHeight        (if "enabled") (cropSFCompression OR rotationSFCompression)
    //2 bytes - subframeLocOffsetX    (if "enabled") (cropSFCompression)
    //2 bytes - subframeLocOffsetY    (if "enabled") (cropSFCompression)
    //1 byte  - subframeDataRotation  (if "enabled") (rotationSFCompression)
    //2 bytes - subframeDelay
    //# bytes - subframeData

    file.read((unsigned char*)checkHeaderFormat, 6);
    char* dataFileVersionString;
    dataFileVersionString = (char*)malloc(3);
    memset(dataFileVersionString, '\0', 3);
    file.read((unsigned char*)dataFileVersionString, 2);
    unsigned long fileTempPostition = file.position();


    bitmapGIF.frameCount = ((file.read()) << 8) | (file.read());
    bitmapGIF.subframeCompressionFlags = file.read();
    bitmapGIF.cropSFCompression = (bitmapGIF.subframeCompressionFlags & 0b10000000) == 0b10000000;
    bitmapGIF.rotationSFCompression = (bitmapGIF.subframeCompressionFlags & 0b01000000) == 0b01000000;
    bitmapGIF.globalsubimageByteLength = ((file.read()) << 8) | (file.read());
    bitmapGIF.widthGPx = ((file.read()) << 8) | (file.read());
    bitmapGIF.heightGPx = ((file.read()) << 8) | (file.read());

    //allocate
    bitmapGIF.subFramePointers = (GIFframebitmapStruct*)malloc(bitmapGIF.frameCount*32);
    

    gifdataReadIndex = 0;
    imagedataSize = 0;
    for (int frameIndex = 0; frameIndex < bitmapGIF.frameCount; frameIndex++) {
      //subimageByteLength, subimageByteOffset, frameStaydelayms, locxPxOffset, locyPxOffset, widthPx, heightPx, subframeDataRotation
      
      if (bitmapGIF.cropSFCompression | bitmapGIF.rotationSFCompression) {
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].widthPx = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
        bitmapGIF.subFramePointers[ frameIndex ].heightPx = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
      }
      if (bitmapGIF.cropSFCompression) {
        bitmapGIF.subFramePointers[ frameIndex ].locPxOffset.x = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
        bitmapGIF.subFramePointers[ frameIndex ].locPxOffset.y = ((file.read()) << 8) | (file.read());
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
      }
      if (bitmapGIF.rotationSFCompression) {
        bitmapGIF.subFramePointers[ frameIndex ].subframeDataRotation = file.read();
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 1;
      }
      bitmapGIF.subFramePointers[ frameIndex ].frameStaydelayms = ((file.read()) << 8) | (file.read());
      bitmapGIF.subFramePointers[ frameIndex ].frameDataPool = (unsigned char*)malloc(bitmapGIF.subFramePointers[ frameIndex ].frameByteLength);
      if (bitmapGIF.cropSFCompression | bitmapGIF.rotationSFCompression) {
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;

        gifdataReadIndex += bitmapGIF.subFramePointers[ frameIndex ].frameByteLength;
        imagedataSize += bitmapGIF.subFramePointers[ frameIndex ].frameByteLength;
        file.read( bitmapGIF.subFramePointers[ frameIndex ].frameDataPool, bitmapGIF.subFramePointers[ frameIndex ].frameByteLength );
      } else {
        bitmapGIF.subFramePointers[ frameIndex ].frameByteLength -= 2;
        
        gifdataReadIndex += bitmapGIF.subFramePointers[ frameIndex ].frameByteLength;
        imagedataSize += bitmapGIF.subFramePointers[ frameIndex ].frameByteLength;
        file.read( bitmapGIF.subFramePointers[ frameIndex ].frameDataPool, bitmapGIF.subFramePointers[ frameIndex ].frameByteLength );
      }

