TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
    }

    free(dataFileVersionString);
  }
  free(checkHeaderFormat);
  Serial.println("load_struct_bitmapGIF_dat_File: End");
}


void display_struct_bitmapGIF(Adafruit_SH1106 &display, GIFbitmapStruct &bitmapGIF, int frame, int locx, int locy) {
  Serial.println("display_struct_bitmapGIF");
  for (byte index = frame; index <= frame; index++) {
    printFreeHeap(Serial);
    Serial.print("index: "); Serial.println(index);
    //Serial.print("subimageByteOffset: "); Serial.println(bitmapGIF.subimageByteOffset[ index ]);
    Serial.print("frameCount: "); Serial.println(bitmapGIF.frameCount);
    Serial.print("gifByteLength: "); Serial.println(bitmapGIF.gifByteLength);

    if (bitmapGIF.cropSFCompression | bitmapGIF.rotationSFCompression) {
      unsigned char* imageTemp;
      imageTemp = (unsigned char*)malloc(bitmapGIF.subFramePointers[ index ].frameByteLength);
      Serial.print("bitmapGIF.subFramePointers[ index ].frameByteLength: "); Serial.println(bitmapGIF.subFramePointers[ index ].frameByteLength);
      memcpy(imageTemp, bitmapGIF.subFramePointers[ index ].frameDataPool, bitmapGIF.subFramePointers[ index ].frameByteLength);
      if (bitmapGIF.cropSFCompression) {
        display.drawBitmap(locx + bitmapGIF.subFramePointers[ index ].locPxOffset.x, locy + bitmapGIF.subFramePointers[ index ].locPxOffset.y, imageTemp, bitmapGIF.subFramePointers[ index ].widthPx, bitmapGIF.subFramePointers[ index ].heightPx, WHITE);
      } else if (bitmapGIF.rotationSFCompression) {
        //add rotate
        display.drawBitmap(locx, locy, imageTemp, bitmapGIF.subFramePointers[ index ].widthPx, bitmapGIF.subFramePointers[ index ].heightPx, WHITE);
      }
      free(imageTemp);
    } else {
      Serial.println("Old Format");
      //Serial.println(bitmapGIF.globalsubimageByteLength);
      //Serial.println(ESP.getMaxAllocHeap());
      /*
        uint32_t getHeapSize(); //total heap size
        uint32_t getFreeHeap(); //available heap
        uint32_t getMinFreeHeap(); //lowest level of free heap since boot
        uint32_t getMaxAllocHeap(); //largest block of heap that can be allocated at once
      */
      printFreeHeap(Serial);
      display.drawBitmap(bitmapGIF.subFramePointers[ index ].locPxOffset.x, bitmapGIF.subFramePointers[ index ].locPxOffset.y, bitmapGIF.subFramePointers[ index ].frameDataPool, bitmapGIF.subFramePointers[ index ].widthPx, bitmapGIF.subFramePointers[ index ].heightPx, WHITE);
    }
    printFreeHeap(Serial);
  }
  Serial.println("display_struct_bitmapGIF: End");
}



/*
   Struct Images and Animations: End
*/















void load_bitmapdat_File(unsigned char*&, unsigned int&, unsigned int&, unsigned int&, File &);

void load_bitmapdat_File(unsigned char* &imageloadlocation, unsigned int &imageDataLength, unsigned int &widthPointer, unsigned int &heightPointer, File &fileBMP) {
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.printf("Address stored in widthPointer variable: %x\n", &widthPointer  );
  Serial.printf("Value of widthPointer variable: %d\n", widthPointer );
  Serial.printf("Address stored in heightPointer variable: %x\n", &heightPointer  );
  Serial.printf("Value of heightPointer variable: %d\n", heightPointer );
  unsigned int frameDataSize;
  frameDataSize = ((fileBMP.read()) << 8) | (fileBMP.read());
  unsigned int frameWidthSize;
  frameWidthSize = ((fileBMP.read()) << 8) | (fileBMP.read()); frameWidthSize++;
  frameDataSize -= 2;
  unsigned int frameHeightSize;
  frameHeightSize = ((fileBMP.read()) << 8) | (fileBMP.read()); frameHeightSize++;
  frameDataSize -= 2;
  //unsigned char* fileImageDataBuffer;
  //fileImageDataBuffer = (unsigned char*)malloc(frameDataSize+1);
  imageloadlocation = (unsigned char*)malloc(frameDataSize + 1);
  fileBMP.read(imageloadlocation, frameDataSize);
  widthPointer = frameWidthSize;
  heightPointer = frameHeightSize;
  imageDataLength = frameDataSize;

  //display.drawBitmap(0, 0, fileImageDataBuffer, frameWidthSize, frameHeightSize, WHITE);
}



void readbitmapdatFile(Adafruit_SH1106 &display, File &fileBMP);

void readbitmapdatFile(Adafruit_SH1106 &display, File &fileBMP) {
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.println("File Content:");
  while (fileBMP.available()) {
    unsigned int frameDataSize;
    frameDataSize = ((fileBMP.read()) << 8) | (fileBMP.read());
    unsigned int frameWidthSize;
    frameWidthSize = ((fileBMP.read()) << 8) | (fileBMP.read()); frameWidthSize++;
    frameDataSize -= 2;
    unsigned int frameHeightSize;
    frameHeightSize = ((fileBMP.read()) << 8) | (fileBMP.read()); frameHeightSize++;
    frameDataSize -= 2;
    unsigned char* fileImageDataBuffer;
    fileImageDataBuffer = (unsigned char*)malloc(frameDataSize + 1);
    //Serial.println(fileBMP.available());Serial.println(frameDataSize);
    fileBMP.read(fileImageDataBuffer, frameDataSize);

    display.clearDisplay();
    display.drawBitmap(0, 0, fileImageDataBuffer, frameWidthSize, frameHeightSize, WHITE);
    display.display();
    free(fileImageDataBuffer);
  }
}








/* Baud-rates available: 300, 600, 1200, 2400, 4800, 9600, 14400, 19200, 28800, 38400, 57600, or 115200, 256000, 512000, 962100

    Protocols available:
   SERIAL_5N1   5-bit No parity 1 stop bit
   SERIAL_6N1   6-bit No parity 1 stop bit
   SERIAL_7N1   7-bit No parity 1 stop bit
   SERIAL_8N1 (the default) 8-bit No parity 1 stop bit
   SERIAL_5N2   5-bit No parity 2 stop bits
   SERIAL_6N2   6-bit No parity 2 stop bits
   SERIAL_7N2   7-bit No parity 2 stop bits
   SERIAL_8N2   8-bit No parity 2 stop bits
   SERIAL_5E1   5-bit Even parity 1 stop bit
   SERIAL_6E1   6-bit Even parity 1 stop bit
   SERIAL_7E1   7-bit Even parity 1 stop bit
   SERIAL_8E1   8-bit Even parity 1 stop bit
   SERIAL_5E2   5-bit Even parity 2 stop bit
   SERIAL_6E2   6-bit Even parity 2 stop bit
   SERIAL_7E2   7-bit Even parity 2 stop bit
   SERIAL_8E2   8-bit Even parity 2 stop bit
   SERIAL_5O1   5-bit Odd  parity 1 stop bit
   SERIAL_6O1   6-bit Odd  parity 1 stop bit
   SERIAL_7O1   7-bit Odd  parity 1 stop bit
   SERIAL_8O1   8-bit Odd  parity 1 stop bit
   SERIAL_5O2   5-bit Odd  parity 2 stop bit
   SERIAL_6O2   6-bit Odd  parity 2 stop bit
   SERIAL_7O2   7-bit Odd  parity 2 stop bit
   SERIAL_8O2   8-bit Odd  parity 2 stop bit
*/
















// Our configuration structure.
//
// Never use a JsonDocument to store the configuration!
// A JsonDocument is *not* a permanent storage; it's only a temporary storage
// used during the serialization phase. See:
// https://arduinojson.org/v6/faq/why-must-i-create-a-separate-config-object/
struct Config {
  char hostname[64];
  int port;
};

void printFile(const char *filename, fs::FS &fs);


const char *filename = "/config.txt";  // <- SD library uses 8.3 filenames
Config config;                         // <- global configuration object

