TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
/*
  #define STORAGE_SELECT_SD 0
  #define STORAGE_SELECT_SPIFFS 1
  #define STORAGE_SELECT_SDFAT 2
  #define STORAGE_SELECT_FFAT 3

  #define STORAGE_INCLUDE_SD false
  #define STORAGE_INCLUDE_SPIFFS true
  #define STORAGE_INCLUDE_SDFAT false
  #define STORAGE_INCLUDE_FFAT false
*/

// Loads the configuration from a file
void loadConfiguration(const char *filename, Config &config, byte storageDevice = STORAGE_DEVICE_DEFAULT) {
  // Open file for reading
  File file;
#if (STORAGE_INCLUDE_SD)
  if (storageDevice == STORAGE_SELECT_SD) {
    file = SD.open(filename);
  }
#endif
#if (STORAGE_INCLUDE_SPIFFS)
  if (storageDevice == STORAGE_SELECT_SPIFFS) {
    file = SPIFFS.open(filename);
  }
#endif


  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use https://arduinojson.org/v6/assistant to compute the capacity.
  StaticJsonDocument<512> doc;
  
  // Deserialize the JSON document
  DeserializationError error = deserializeJson(doc, file);
  if (error)
    Serial.println(F("Failed to read file, using default configuration"));

  // Copy values from the JsonDocument to the Config
  config.port = doc["port"] | 2731;
  strlcpy(config.hostname,                  // <- destination
          doc["hostname"] | "example.com",  // <- source
          sizeof(config.hostname));         // <- destination's capacity

  // Close the file (Curiously, File's destructor doesn't close the file)
  file.close();
}


// Saves the configuration to a file
void saveConfiguration(const char *filename, const Config &config, byte storageDevice = STORAGE_DEVICE_DEFAULT) {
  // Delete existing file, otherwise the configuration is appended to the file
#if (STORAGE_INCLUDE_SD)
  if (storageDevice == STORAGE_SELECT_SD) {
    SD.remove(filename);
  }
#endif
#if (STORAGE_INCLUDE_SPIFFS)
  if (storageDevice == STORAGE_SELECT_SPIFFS) {
    SPIFFS.remove(filename);
  }
#endif

  // Open file for writing
  File file;
#if (STORAGE_INCLUDE_SD)
  if (storageDevice == STORAGE_SELECT_SD) {
    file = SD.open(filename, FILE_WRITE);
  }
#endif
#if (STORAGE_INCLUDE_SPIFFS)
  if (storageDevice == STORAGE_SELECT_SPIFFS) {
    file = SPIFFS.open(filename, FILE_WRITE);
  }
#endif


  if (!file) {
    Serial.println(F("Failed to create file"));
    return;
  }

  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use https://arduinojson.org/assistant to compute the capacity.
  StaticJsonDocument<512> doc;
  
  // Set the values in the document
  doc["hostname"] = config.hostname;
  doc["port"] = config.port;
  
  // Serialize JSON to file
  if (serializeJson(doc, file) == 0) {
    Serial.println(F("Failed to write to file"));
  }
  
  // Close the file
  file.close();
}

// Prints the content of a file to the Serial
void printFile(const char *filename, fs::FS &fs) {
  // Open file for reading
  File file;
  file = fs.open(filename);
  
  if (!file) {
    Serial.println(F("Failed to read file"));
    return;
  }

  // Extract each characters by one by one
  while (file.available()) {
    Serial.print((char)file.read());
  }
  Serial.println();

  // Close the file
  file.close();
}







void test_bmp_image_file_read()
{
  printFreeHeap(Serial);
  File fileBMP = SPIFFS.open("/gigachad64h.bmp");
  IMGbitmapStruct gigaChadTest;
  printFreeHeap(Serial);
  Serial.println("IMGbitmapStruct Test: Begin");
  
  load_bitmapIMG_File_struct(fileBMP, gigaChadTest);
  display.clearDisplay();
  display_struct_bitmapIMG(display, gigaChadTest, 0, 0);
  display.display();
  
  fileBMP.close();
  printFreeHeap(Serial);
}



void test_bitmapgif_dat_FBF()
{
  printFreeHeap(Serial);
  File fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.dat");
  IMGbitmapStruct boyKisserTest;
  printFreeHeap(Serial);
  Serial.println("IMGbitmapStruct Test: Begin");
  while (fileBMP.available()) {
    load_struct_bitmapIMG_dat_File(fileBMP, boyKisserTest);
    display.clearDisplay();
    display_struct_bitmapIMG(display, boyKisserTest, 0, 0);
    display.display();
  }
  fileBMP.close();
  printFreeHeap(Serial);
}

void test_bitmapgif_dat_GIF()
{
  GIFbitmapStruct boyKisserGIFTest;
  File fileStructBMP;
  fileStructBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.dat");
  load_struct_bitmapGIF_dat_File(fileStructBMP, boyKisserGIFTest);
  Serial.println(fileStructBMP);
  fileStructBMP.close();
  
  for(byte frame = 0; frame < boyKisserGIFTest.frameCount; frame++){
    display.clearDisplay();
    display_struct_bitmapGIF(display, boyKisserGIFTest, frame, 0, 0);
    Serial.print("Frame: ");Serial.print(frame);Serial.print("/");Serial.println(boyKisserGIFTest.frameCount);
    display.display();
  }
  //free(boyKisserGIFTest);
  Serial.println("IMGbitmapStruct Test: End");
}




void printParameters(Stream &serialport, struct Configuration configuration);
void printModuleInformation(Stream &serialport, struct ModuleInformation moduleInformation);


void printScrollText(Adafruit_SH1106 &display, char textInput[], unsigned int textMaxScrollLength, unsigned int frameOffset);





//https://www.freertos.org/a00106.html
TaskHandle_t Task1;
TaskHandle_t Task2;
TaskHandle_t Task3;
TaskHandle_t Task4;
TaskHandle_t Task5;

TaskHandle_t Task6;
TaskHandle_t Task7;
TaskHandle_t Task8;
TaskHandle_t Task9;
TaskHandle_t Task10;


TaskHandle_t TaskIRDecode;
TaskHandle_t Task_WiFi_LoRa_Bridge;
TaskHandle_t TaskWiFiMultiConnect;
TaskHandle_t TaskBuzzer;





//https://forum.arduino.cc/t/how-can-i-do-dual-core-task-use-same-memory-esp32-rtos/702929/24?page=2 //https://youtu.be/ywbq1qR-fY0?t=1206
QueueHandle_t queue;



//https://docs.espressif.com/projects/esp-idf/en/v4.3/esp32s2/api-reference/peripherals/index.html
void setup()   {
  Serial.begin(115200);
  Serial.print("setup() running on core "); Serial.println(xPortGetCoreID());
  printFreeHeap(Serial);
  //https://espressif-docs.readthedocs-hosted.com/projects/arduino-esp32/en/latest/api/preferences.html
  //https://randomnerdtutorials.com/esp32-save-data-permanently-preferences/
  Serial.println( preferences.begin("boyKisser", false, "nvs"));
  preferences.end();
  //setup Pins

#if (FeatureEnable_IR_RXTX_Control==true)
  //IR Pins
  //pinMode(IR_TX_Pin, OUTPUT);
  IrSender.begin(IR_TX_Pin, ENABLE_LED_FEEDBACK, USE_DEFAULT_FEEDBACK_LED_PIN); // Specify send pin and enable feedback LED at default feedback LED pin

  //pinMode(IR_RX_Pin, INPUT);
  IrReceiver.begin(IR_RX_Pin, ENABLE_LED_FEEDBACK); // Start the receiver
#endif

  //MIC Pin
  pinMode(MIC_Pin, INPUT);


  //Buzzer Boi Pin
  //https://github.com/pschatzmann/arduino-audio-tools
  pinMode(buzzerPin, OUTPUT);

