TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  //BatterySensePin
  pinMode(batteryVoltageDivider, INPUT);

  // Startup all pins and UART
  e220ttl.begin();//LoRa Usage



  //Enable Devices
  adc_power_on();

  //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/performance/size.html#idf-py-size
  printFreeHeap(Serial);
#if (FeatureEnable_BT_Serial==true)
  SerialBT.begin("ESP32btSerial"); //Bluetooth device name
  Serial.println("The device started, now you can pair it with bluetooth!");
  printFreeHeap(Serial);
#endif



  if (!SPIFFS.begin(true)) {
    Serial.println("An Error has occurred while mounting SPIFFS");
    return;
  }
  File file;
  file = SPIFFS.open("/test_example.txt");
  if (!file) {
    Serial.println("Failed to open file for reading");
    return;
  }

  Serial.println("File Content:");
  while (file.available()) {
    Serial.write(file.read());
  }
  file.close();

  file = SPIFFS.open("/Wifi_Connections.json");
  if (!file) {
    Serial.println("Failed to open file for reading");
    return;
  }

  Serial.println("File Content:");
  while (file.available()) {
    Serial.write(file.read());
  }
  file.close();


  /*
    Dictionary *buttonNamesDict = new Dictionary();//buttonNamesDict
    buttonNamesDict->insert("0", "key_Up");
    buttonNamesDict->insert("1", "key_Start");
    buttonNamesDict->insert("2", "key_Select");
    buttonNamesDict->insert("3", "key_A");
    buttonNamesDict->insert("4", "key_Left");
    buttonNamesDict->insert("5", "key_Down");
    buttonNamesDict->insert("6", "key_Right");
    buttonNamesDict->insert("7", "key_B");
  */


  // by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
  display.begin(SH1106_SWITCHCAPVCC, 0x3C);  // initialize with the I2C addr 0x3D (for the 128x64)
  // init done

  // Show image buffer on the display hardware.
  // Since the buffer is intialized with an Adafruit splashscreen
  // internally, this will display the splashscreen.
  display.display();
  delay(200);

  // Clear the buffer.
  display.stopscroll();
  display.clearDisplay();  
  
  


  /*
   * Startup Tests Starts
   */
  //Text Image Read
  printFreeHeap(Serial);

  /*
    static unsigned char animationFrameBuffer[1024*16];
    unsigned char* framepointerArray[22];
    File fileBMP;
    fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.dat");
    //loads file into large buffer then saves pointers and plays frames from pointers
    unsigned char* imageloadlocation;
    unsigned int imageDataLength = 0;
    unsigned int imageWidth = 0;
    unsigned int imageHeight = 0;
    Serial.println("File Content:");
    unsigned int currentFrame = 0;
    unsigned int currentAnimationDataLength = 0;

    while(fileBMP.available()){
    load_bitmapdat_File(imageloadlocation, imageDataLength, imageWidth, imageHeight, fileBMP);
    framepointerArray[currentFrame] = &animationFrameBuffer[ currentAnimationDataLength ];
    memcpy(framepointerArray[currentFrame], imageloadlocation, imageDataLength);
    currentAnimationDataLength += imageDataLength;
    Serial.println(currentFrame);
    currentFrame++;
    }

    fileBMP.close();

    long int t1 = micros();
    for (unsigned int index=0; index < 22; index++){
    display.clearDisplay();
    display.drawBitmap(0, 0, framepointerArray[index], imageWidth, imageHeight, WHITE);
    display.display();
    }
    long int t2 = micros();
    display.clearDisplay();
    display.setCursor(0, 0);
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.print("Frames: "); display.print( 22 ); display.println();
    display.print("T-Time(ns): "); display.print( t2-t1 ); display.println("");
    display.print("FPS: "); display.print( (double)(22/((double)(t2-t1)/1000000)) ); display.println();
    //Serial.print("Time taken by the task: "); Serial.print(t2-t1); Serial.println(" microseconds(ns)");
    display.display();
    delay(1500);
  */
  printFreeHeap(Serial);
  
  test_bmp_image_file_read();
  printFreeHeap(Serial);
  delay(1000);
  
  test_bitmapgif_dat_FBF();
  
  delay(250);
  test_bitmapgif_dat_GIF();
  
  delay(250);
  
  
  printFreeHeap(Serial);
  /*
  {
  File fileBMP;
  fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.dat");
  readbitmapdatFile(display, fileBMP);
  fileBMP.close();
  }
  delay(250);
  //*/
  
  /*
  {
  //Neco-Arc_bitmapimg.dat
  File fileBMP;
  fileBMP = SPIFFS.open("/Neco-Arc_bitmapimg.dat");
  readbitmapdatFile(display, fileBMP);
  fileBMP.close();
  }
  delay(250);
  */

  printFreeHeap(Serial);
  bool hexTest = false;//true;
  if (hexTest)
  {
  File fileBMP;
  fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.hex");
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.println("File Content:");
  while (fileBMP.available()) {
    char fileDataSizeBuffer[(2) * 2 + 1];
    char fileImageDataBuffer[2048];
    memset(fileDataSizeBuffer, '\0', (2) * 2 + 1);
    memset(fileImageDataBuffer, '\0', 2048);
    fileBMP.readBytes(fileDataSizeBuffer, (2) * 2);
    //Serial.write(fileDataSizeBuffer, strlen(fileDataSizeBuffer));
    //Serial.println();
    uint16_t frameDataSize;
    char *ptr;
    frameDataSize = strtol(fileDataSizeBuffer, &ptr, 16);
    fileBMP.readBytes(fileImageDataBuffer, (frameDataSize) * 2);
    //Serial.write(fileImageDataBuffer, strlen(fileImageDataBuffer));
    //Serial.println();
    char tempCharArray[3]; memset(tempCharArray, '\0', 3);
    strncpy(tempCharArray, &fileImageDataBuffer[(0 * 2) * 2], (2) * 2);
    uint16_t frameWidthSize = strtol(tempCharArray, &ptr, 16) + 1;
    strncpy(tempCharArray, &fileImageDataBuffer[(1 * 2) * 2], (2) * 2);
    uint16_t frameHeightSize = strtol(tempCharArray, &ptr, 16) + 1;
    display.clearDisplay();
    display.drawBitmap(0, 0, convertTextHextoCharArray( &fileImageDataBuffer[(2) * 2 + (2) * 2] ), frameWidthSize, frameHeightSize, WHITE); //Test Image Read
    display.display();
  }
  fileBMP.close();
  }
  delay(250);

  printFreeHeap(Serial);
  
  bool rotTest = true;//true;
  if (rotTest)
  {
  //"/boyKisserFaceGif_bitmapgif.txt"
  File fileBMP;
  fileBMP = SPIFFS.open("/boyKisserFaceGif_bitmapgif.txt");
  if (!fileBMP) {
    Serial.println("Failed to open file for reading");
    return;
  }
  Serial.println("File Content:");
  
  //init buffers
  char filereadBuffer[2048];
  char fileImageBuffer[2048];
  memset(filereadBuffer, '\0', 2048);
  memset(fileImageBuffer, '\0', 2048);
  //image Basic Test Loop
  while (fileBMP.available()) {
    fileBMP.readBytesUntil('\n', filereadBuffer, 2048);
    fileBMP.readBytesUntil('\n', fileImageBuffer, 2048);
    display.clearDisplay();
    display.drawBitmap(0, 0, convertTextHextoCharArray( fileImageBuffer ), 85, 64, WHITE);//Test Image Read
    ///*
    printFreeHeap(Serial);
    unsigned char* rotateImageTest;
    rotateImageTest = (unsigned char *) calloc(4 * 32, sizeof(unsigned char *)); //32*32
    bitmapIMGmanipulate0.rotateBitImageClockwise( rotateImageTest, (unsigned char*)rotateImageTestIcon, 32, 32);//rotates 90 deg clockwise //new Px Width and Height will be flipped
    display.drawBitmap(90, 0, rotateImageTest, 32, 32, WHITE);//Test Image Read
    //*/
    display.display();
    Serial.println("Displayed");
    //delay(2000);
    ///*
    printFreeHeap(Serial);
    unsigned char* betterRotateImageTest;
    betterRotateImageTest = (unsigned char *) calloc(16 * 128, sizeof(unsigned char *)); //85*64
    Serial.println("CheckPoint");
    bitmapIMGmanipulate0.rotateBitImageClockwise( betterRotateImageTest, convertTextHextoCharArray( fileImageBuffer ), 85, 64);//rotates 90 deg clockwise //new Px Width and Height will be flipped
    display.clearDisplay();
    display.drawBitmap(0, 0, betterRotateImageTest, 64, 85, WHITE);//Test Image Read
    display.display();
    free(betterRotateImageTest);
    //*/
    //delay(2000);
  }
  fileBMP.close();
  }

  printFreeHeap(Serial);
  /*
   * Startup Tests Ends
   */

