TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
void Task1code( void * pvParameters ) {
  Serial.print("Task1 running on core "); Serial.println(xPortGetCoreID());
  //BatteryStatusCheck
  double vin;
  double maxVin;
  double minVin;
  for (;;) {
    if (autoUPdateBatteryVariables){
      //Calculate Battery Percentage
      
      vin = calculateVoltageDivider(100000, 100000, batteryVoltageDivider);
      maxVin = 4.1;
      minVin = 3.3;
      /*
      double vin = calculateVoltageDivider(100000, 100000, batteryVoltageDivider);
      double maxVin = 4.1;
      double minVin = 3.3;
      //*/
      batteryPercent = (byte)mapdouble((double)vin, (double)minVin, (double)maxVin, (double)0.0, (double)100.0);
      batteryVoltage = vin;
      chargingFlag = false;
      //Serial.print("batteryPercent%:");Serial.println(batteryPercent);
    }
    delay(1000);
  }
  Serial.println("Ending Task1");
  vTaskDelete( NULL );
}

void Task2code( void * pvParameters ) {
  Serial.print("Task2 running on core "); Serial.println(xPortGetCoreID());
  //GetTime
  for (;;) {
    printLocalTime(Serial);
    delay(10000);
  }
  Serial.println("Ending Task2");
  vTaskDelete( NULL );
}


void Task4code( void * pvParameters ) {
  Serial.print("Task4 running on core "); Serial.println(xPortGetCoreID());
  for (;;) {
    delay(4000);
  }
  Serial.println("Ending Task4");
  vTaskDelete( NULL );
} 

void Task5code( void * pvParameters ) {
  Serial.print("Task5 running on core "); Serial.println(xPortGetCoreID());
  delay(1000);
  Serial.println("Ending Task5");
  vTaskDelete( NULL );
}


void TaskIRDecodeFunc( void * pvParameters ) {
  Serial.print("TaskIRDecodeFunc running on core "); Serial.println(xPortGetCoreID());
  for (;;) {
    ///*
    #if (FeatureEnable_IR_RXTX_Control==true)
    if (IrReceiver.decode()) {
      Serial.print("IR_Receiver:");
      Serial.println(IrReceiver.decodedIRData.decodedRawData, HEX); // Print "old" raw data
      // USE NEW 3.x FUNCTIONS
      IrReceiver.printIRResultShort(&Serial); // Print complete received data in one line
      IrReceiver.printIRSendUsage(&Serial);   // Print the statement required to send this data
      
      IrReceiver.resume(); // Enable receiving of the next value
    }
    #endif
    //*/
    delay(3000);
  }
  Serial.println("Ending TaskIRDecodeFunc");
  vTaskDelete( NULL );
}



void TaskWiFiLoRaBridgeFunc( void * pvParameters ) {
  //Mesh
  Serial.print("TaskWiFiBridgeSTAtoAPFunc running on core "); Serial.println(xPortGetCoreID());
  Serial.print("TaskWiFiBridgeLoRatoAPFunc running on core "); Serial.println(xPortGetCoreID());
  Serial.print("TaskWiFiBridgeSTAtoLoRaFunc running on core "); Serial.println(xPortGetCoreID());
  //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/esp-wifi-mesh.html#overview
  //https://randomnerdtutorials.com/esp-mesh-esp32-esp8266-painlessmesh/
  
  //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/network/esp_wifi.html
  //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-guides/wifi.html
  //https://randomnerdtutorials.com/esp32-useful-wi-fi-functions-arduino/
  //https://randomnerdtutorials.com/esp32-wifimulti/
  
  //https://randomnerdtutorials.com/esp32-access-point-ap-web-server/
  
  for (;;) {
    //https://espressif-docs.readthedocs-hosted.com/projects/arduino-esp32/en/latest/api/wifi.html
    uint8_t softAP_getStationNum = WiFi.softAPgetStationNum();
    Serial.print("Stations connected: ");
    Serial.println(softAP_getStationNum);
    IPAddress softAP_BroadcastIP = WiFi.softAPBroadcastIP();
    Serial.print("softAPBroadcastIP: ");
    Serial.println(softAP_BroadcastIP);
    IPAddress softAP_IP = WiFi.softAPIP();
    Serial.print("softAPIP: ");
    Serial.println(softAP_IP);
    IPAddress softAP_NetworkID = WiFi.softAPNetworkID();
    Serial.print("softAPNetworkID: ");
    Serial.println(softAP_NetworkID);
    delay(750);
  }
  Serial.println("Ending TaskWiFiBridgeSTAtoAPFunc");
  vTaskDelete( NULL );
}


void TaskWiFiMultiConnectFunc( void * pvParameters ) {
  Serial.print("TaskWiFiMultiConnectFunc running on core "); Serial.println(xPortGetCoreID());
  for (;;) {
    //if the connection to the stongest hotstop is lost, it will connect to the next network on the list
    ///*
    if (wifiMulti.run(connectTimeoutMs) == WL_CONNECTED) {
      Serial.print("WiFi connected: ");
      Serial.print(WiFi.SSID());
      Serial.print(" ");
      Serial.println(WiFi.RSSI());
    }
    else {
      Serial.println("WiFi not connected!");
    }
    //*/
    delay(10000);
  }
  Serial.println("Ending TaskWiFiMultiConnectFunc");
  vTaskDelete( NULL );
}


void TaskBuzzercode( void * pvParameters ) {
  //https://techtutorialsx.com/2017/05/07/esp32-arduino-passing-a-variable-as-argument-of-a-freertos-task/
  Serial.print("TaskBuzzer running on core "); Serial.println(xPortGetCoreID());
  Serial.println(*((char*)pvParameters));
  char *cName = ((char*)pvParameters);
  Serial.println(cName);
  //Work on Me!
  int *sound;
  sound = (int*)calloc(1024, sizeof(int));
  for (int index = 0; index < 1024; index++) {
    analogWrite(buzzerPin, sound[ index ]);
    delayMicroseconds(10);
  }
  
  free(sound);
  Serial.println("Ending TaskBuzzer");
  vTaskDelete( NULL );
}



static const unsigned char PROGMEM buttonInputIcon4x8[2][8] =
{
  {
    B11110000,
    B01100000,
    B11110000,
    B01100000,
    B11110000,
    B01100000,
    B11110000,
    B01100000,
  },
  {
    B11110000,
    B01100000,
    B00000000,
    B10010000,
    B01100000,
    B00000000,
    B10010000,
    B01100000,
  },
};



//Try esp32's inner Temp Sensor


void loop()
{
  // put your main code here, to run repeatedly:
  //Serial.print("loop() running on core "); Serial.println(xPortGetCoreID());
  Serial.print("Main_loop() running on core "); Serial.println(xPortGetCoreID());
  
  
  //calculate FPS
  system_Frame_FPS = (double)(1 / ((double)(frameEndTime - frameStartTime) / 1000000));
  //\/ start Frame Here \/
  frameStartTime = micros();

  ftpSrv.handleFTP();        //make sure in loop you call handleFTP()!!  
  // server.handleClient();   //example if running a webserver you still need to call .handleClient();
  

  char localIntVar[64];
  strcpy(localIntVar, "Buzzer.pwm");
  //create a task that will be executed in the TaskBuzzercode() function, with priority 20 and executed on core 1
  xTaskCreatePinnedToCore(
    TaskBuzzercode,   /* Task function. */
    "TaskBuzzercode",     /* name of task. */
    8192,       /* Stack size of task */
    (void*)&localIntVar[0],        /* parameter of the task */
    20,           /* priority of the task */
    &TaskBuzzer,      /* Task handle to keep track of created task */
    1);          /* pin task to core 1 */
    

  if (timeConfigured==false){
    if (WiFi.status() == WL_CONNECTED){
      configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
      timeConfigured = true;
    }
  }
  
  
  
  
  if (disableButtonPISO_update == false) {
    buttonpiso1.update();
  };
  display.clearDisplay();
  display.setCursor(0, 0);
  
  printButtonPISODebug();
  display.setCursor(0, 0);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.print("RawButtons:"); display.println(buttonpiso1.getRAWState(), BIN);
  /*
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.println("frameCountVariable:");
  display.print("->");display.println(frameCountVariable, DEC);
  //*/
  if (showDebugMenu == true) {
#if (FeatureEnable_BT_Serial==true)
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.print("BTserial.avail:"); display.println(SerialBT.available(), DEC);
#endif
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.print("CurrentMenuID:"); display.println(currentMenuID, DEC);
    
