TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
    if (commandSelect(debugCommand, "set ")) {
      strcpy(targetCommand, "set ");
      strcpy(commandInputs, &debugCommand[strlen(targetCommand)]);
      printCharArrayValue(serialport, commandInputs, "commandInputs");
      if (commandSelect(commandInputs, "taskbarRotation ")) {
        //command format: set taskbarRotation #
        //command format: set taskbarRotation hidden
        strcpy(subTargetCommand, "taskbarRotation ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
        //https://linuxhint.com/arduino-atoi-function/
        taskbarRotation = atoi(subCommandInputs);//outputs 0 if 0 or is not a valid number
        if (taskbarRotation == 0) {
          if (strcmp(subCommandInputs, "hidden") == 0) {
            taskbarRotation = 0;//taskbar is hidden
          }
        }
        taskbarRotation = taskbarRotation - 1;
        if (taskbarRotation < 0) {
          taskbarRotation = 4;//taskbar is hidden
        }
      }
      if (commandSelect(commandInputs, "chargingFlag ")) {
        //command format: set chargingFlag #
        strcpy(subTargetCommand, "chargingFlag ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
        chargingFlag = atoi(subCommandInputs);
      }
      if (commandSelect(commandInputs, "DebugMenu ")) {
        //command format: set DebugMenu hidden
        //command format: set DebugMenu show
        //command format: set DebugMenu invisible
        //command format: set DebugMenu visible
        strcpy(subTargetCommand, "DebugMenu ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");

        if (strcmp(subCommandInputs, "hidden") == 0) {
          showDebugMenu = 0;
        }
        if (strcmp(subCommandInputs, "show") == 0) {
          showDebugMenu = 1;
        }
        if (strcmp(subCommandInputs, "invisible") == 0) {
          showDebugMenu = 0;
        }
        if (strcmp(subCommandInputs, "visible") == 0) {
          showDebugMenu = 1;
        }
        if (showDebugMenu == 0) {
          serialPrintMessageFrom("System_Debug", "hiding debug menu");
        }
        if (showDebugMenu == 1) {
          serialPrintMessageFrom("System_Debug", "showing debug menu");
        }
      }
      if (commandSelect(commandInputs, "MenuID ")) {
        //command format: set MenuID #
        strcpy(subTargetCommand, "MenuID ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
        currentMenuID = atoi(subCommandInputs);
      }

#if (FeatureEnable_IR_RXTX_Control==true)
      //https://github.com/Arduino-IRremote/Arduino-IRremote/blob/master/examples/SendDemo/SendDemo.ino
      if (commandSelect(commandInputs, "IRSender ")) {
        //command format: set IRSender sendValue
        strcpy(subTargetCommand, "IRSender ");
        strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
        printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");

        char *ptr;
        unsigned int sendValue;//0xBD3D00802002

        sendValue = strtoul(subCommandInputs, &ptr, 16);
        serialport.println(sendValue, HEX);
        //IrSender.sendRaw(aIRDataToSend->rawCode, aIRDataToSend->rawCodeLength, 38);
        //const uint16_t irSignal[] = 0xBD3D00802002;//Power Button
        //Protocol=Panasonic Address=0x8 Command=0x3D Repeat gap=74500us Raw-Data=0xBD3D00802002 48 bits LSB first
        //IrSender.sendRaw(irSignal, sizeof(irSignal) / sizeof(irSignal[0]), 38);

        IrSender.sendNECRaw(sendValue, 1);
      }
#endif


      //

    }

  }
}


void serial_ButtonPISO_DebugCommands(Stream &serialport, char *debugCommand)
{
  char targetCommand[ MAXDEBUG_TARGETCOMMAND_LENGTH ];
  char commandInputs[ MAXDEBUG_COMMANDINPUT_LENGTH ];
  char subTargetCommand[ MAXDEBUG_SUBTARGETCOMMAND_LENGTH ];
  char subCommandInputs[ MAXDEBUG_SUBCOMMANDINPUT_LENGTH ];

  char cacheCommand_0[64];
  char cacheCommand_1[64];
  char valueCommandCheckCache_0[64];
  char valueCommandCheckCache_1[64];
  char valueCommandCheckCache_2[64];
  char valueCommandCheckCache_3[64];
  int intDebugValue_0;
  int intDebugValue_1;
  int intDebugValue_2;
  int intDebugValue_3;

  printCharArrayValue(serialport, debugCommand, "Debug Command");

  if (commandSelect(debugCommand, "BPISO ")) {
    strcpy(targetCommand, "BPISO ");
    strcpy(commandInputs, &debugCommand[strlen(targetCommand)]);
    printCharArrayValue(serialport, commandInputs, "commandInputs");

    if (commandSelect(commandInputs, "auto_update ")) {
      //command format: BPISO auto_update enable
      //command format: BPISO auto_update disable
      strcpy(subTargetCommand, "ButtonPISO_update ");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");

      if (strcmp(subCommandInputs, "enable") == 0) {
        disableButtonPISO_update = false;
        serialPrintMessageFrom("System_Debug", "enabled ButtonPISO update");
      } else if (strcmp(subCommandInputs, "disable") == 0) {
        disableButtonPISO_update = true;
        serialPrintMessageFrom("System_Debug", "disabled ButtonPISO update");
      }
    }
    if (commandSelect(commandInputs, "setInput ")) {
      //command format: BPISO setInput buttonID/buttonName LOW
      //command format: BPISO setInput buttonID/buttonName HIGH
      strcpy(subTargetCommand, "ButtonPISO ");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      for (uint8_t buttonIndex = 0; buttonIndex < buttonPISOcount; buttonIndex++) {
        strcpy(valueCommandCheckCache_0, buttonNameString[buttonIndex]);
        strcat(valueCommandCheckCache_0, " ");
        itoa(buttonIndex, valueCommandCheckCache_1, 10);
        strcat(valueCommandCheckCache_1, " ");
        if (commandSelect(subCommandInputs, valueCommandCheckCache_0)) {
          intDebugValue_0 = buttonIndex;
          strcpy(cacheCommand_0, &subCommandInputs[strlen(valueCommandCheckCache_0)]);
          serialport.println("Name");
        } else if (commandSelect(subCommandInputs, valueCommandCheckCache_1)) {
          intDebugValue_0 = buttonIndex;
          strcpy(cacheCommand_0, &subCommandInputs[strlen(valueCommandCheckCache_1)]);
          serialport.println("ID");
        } else {
          continue;
        }
        serialport.println(cacheCommand_0);
        if (strcmp(cacheCommand_0, "HIGH") == 0) {
          buttonpiso1.overrideButtonState(intDebugValue_0, HIGH);
          serialPrintMessageFrom("System_Debug", "ButtonPISO State Changed");
        }
        if (strcmp(cacheCommand_0, "LOW") == 0) {
          buttonpiso1.overrideButtonState(intDebugValue_0, LOW);
          serialPrintMessageFrom("System_Debug", "ButtonPISO State Changed");
        }
      }
    }
    //

