TerrienDJV5/Netogatchi-ESP32-V1/Software/tamagotchi_V0.0.0_for_Hardware_V1/tamagotchi_V0.0.0_for_Hardware_V1.ino
  }
}


void serial_LoRa_DebugCommands(Stream &serialport, char *debugCommand)
{
  char targetCommand[ MAXDEBUG_TARGETCOMMAND_LENGTH ];
  char commandInputs[ MAXDEBUG_COMMANDINPUT_LENGTH ];
  char subTargetCommand[ MAXDEBUG_SUBTARGETCOMMAND_LENGTH ];
  char subCommandInputs[ MAXDEBUG_SUBCOMMANDINPUT_LENGTH ];
  printCharArrayValue(serialport, debugCommand, "Debug Command");
  if (commandSelect(debugCommand, "control LoRa ")) {
    strcpy(targetCommand, "control LoRa ");
    strcpy(commandInputs, &debugCommand[strlen(targetCommand)]);
    printCharArrayValue(serialport, commandInputs, "commandInputs");
    //
    if (commandSelect(commandInputs, "getconfig")) {
      //command format: control LoRa getconfig
      strcpy(subTargetCommand, "getconfig");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      printLoRaConfig(serialport, e220ttl);
    }
  }
}




void serial_WiFi_DebugCommands(Stream &serialport, char *debugCommand)
{
  char targetCommand[ MAXDEBUG_TARGETCOMMAND_LENGTH ];
  char commandInputs[ MAXDEBUG_COMMANDINPUT_LENGTH ];
  char subTargetCommand[ MAXDEBUG_SUBTARGETCOMMAND_LENGTH ];
  char subCommandInputs[ MAXDEBUG_SUBCOMMANDINPUT_LENGTH ];
  printCharArrayValue(serialport, debugCommand, "Debug Command");
  if (commandSelect(debugCommand, "control WiFi ")) {
    strcpy(targetCommand, "control WiFi ");
    strcpy(commandInputs, &debugCommand[strlen(targetCommand)]);
    printCharArrayValue(serialport, commandInputs, "commandInputs");
    //https://www.mischianti.org/2021/03/06/esp32-practical-power-saving-manage-wifi-and-cpu-1/
    //https://randomnerdtutorials.com/esp32-useful-wi-fi-functions-arduino/
    //https://espressif-docs.readthedocs-hosted.com/projects/arduino-esp32/en/latest/api/wifi.html
    //https://reference.arduino.cc/reference/en/libraries/wifi/
    //https://randomnerdtutorials.com/esp32-useful-wi-fi-functions-arduino/
    if (commandSelect(commandInputs, "scanNetworks")) {
      //command format: control WiFi scanNetworks
      strcpy(subTargetCommand, "scanNetworks");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      int n = WiFi.scanNetworks();
      serialport.print("Connections: "); serialport.println(n);
      for (int index = 0; index < n; index++) {
        serialport.print(WiFi.SSID(index)); serialport.print(" RRSI: "); serialport.println(WiFi.RSSI(index));
      }
    }
    if (commandSelect(commandInputs, "showModes ")) {
      //command format: control WiFi showMode
      strcpy(subTargetCommand, "showMode ");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      serialport.println("WiFi.mode(WIFI_STA)  station mode: the ESP32 connects to an access point");
      serialport.println("WiFi.mode(WIFI_AP)  access point mode: stations can connect to the ESP32");
      serialport.println("WiFi.mode(WIFI_AP_STA)  access point and a station connected to another access point");
    }
    if (commandSelect(commandInputs, "setMode ")) {
      //command format: control WiFi setMode WIFI_STA
      //command format: control WiFi setMode WIFI_AP
      //command format: control WiFi setMode WIFI_AP_STA
      strcpy(subTargetCommand, "setMode ");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      if (strcmp(subCommandInputs, "WIFI_STA") == 0) {
        WiFi.mode(WIFI_STA);  //station mode: the ESP32 connects to an access point
      }
      if (strcmp(subCommandInputs, "WIFI_AP") == 0) {
        WiFi.mode(WIFI_AP);  //access point mode: stations can connect to the ESP32
      }
      if (strcmp(subCommandInputs, "WIFI_AP_STA") == 0) {
        WiFi.mode(WIFI_AP_STA);  //access point and a station connected to another access point
      }
    }
    if (commandSelect(commandInputs, "getMode ")) {
      //command format: control WiFi getMode
      strcpy(subTargetCommand, "getMode ");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      serialport.print("WiFi.getMode():"); serialport.print(WiFi.getMode()); serialport.print(", ");
      if (WiFi.getMode() == WIFI_MODE_NULL) {
        serialport.println("WiFi.getMode() == WIFI_MODE_NULL");
      };
      if (WiFi.getMode() == WIFI_MODE_STA) {
        serialport.println("WiFi.getMode() == WIFI_MODE_STA");
      };
      if (WiFi.getMode() == WIFI_MODE_AP) {
        serialport.println("WiFi.getMode() == WIFI_MODE_AP");
      };
      if (WiFi.getMode() == WIFI_MODE_APSTA) {
        serialport.println("WiFi.getMode() == WIFI_MODE_APSTA");
      };
      if (WiFi.getMode() == WIFI_MODE_MAX) {
        serialport.println("WiFi.getMode() == WIFI_MODE_MAX");
      };
    }
    if (commandSelect(commandInputs, "connect ")) {
      //command format: control WiFi connect "SSID" "PassWord"
      strcpy(subTargetCommand, "connect ");
      strcpy(subCommandInputs, &commandInputs[strlen(subTargetCommand)]);
      printCharArrayValue(serialport, subCommandInputs, "subCommandInputs");
      
      const char ch0 = '"';
      char *pointer0;
      char *pointer1;
      char *pointer2;
      char *pointer3;
      unsigned int pSize0;
      unsigned int pSize1;
      unsigned int pSize2;
      unsigned int pSize3;
      char STA_SSID[33];
      char STA_PASS[64];
      memset(STA_SSID, '\0', 33);
      memset(STA_PASS, '\0', 64);
      pointer0 = strchr(subCommandInputs, ch0);
      pSize0 = strlen(pointer0);
      pointer1 = strchr(&pointer0[1], ch0);
      pSize1 = strlen(pointer1);
      pointer2 = strchr(&pointer1[1], ch0);
      pSize2 = strlen(pointer2);
      pointer3 = strchr(&pointer2[1], ch0);
      pSize3 = strlen(pointer3);
      
      serialport.printf("Looling For: |%c|\n", ch0);
      serialport.printf("Pointer0: |%s| Len=%d\n", pointer0, pSize0);
      serialport.printf("Pointer1: |%s| Len=%d\n", pointer1, pSize1);
      serialport.printf("Pointer2: |%s| Len=%d\n", pointer2, pSize2);
      serialport.printf("Pointer3: |%s| Len=%d\n", pointer3, pSize3);
      
      strncpy(STA_SSID, &pointer0[1], pSize0-pSize1-1);
      strncpy(STA_PASS, &pointer2[1], pSize2-pSize3-1);
      serialport.printf("STA_SSID: |%s|\n", STA_SSID);
      serialport.printf("STA_PASS: |%s|\n", STA_PASS);
      
      serialport.println("Saving Wifi Credentials!");
      Credentials_WiFi_Struct wifiCredential;
      strcpy(wifiCredential.ssid, STA_SSID);
      strcpy(wifiCredential.pass, STA_PASS);
      readFile(serialport, SPIFFS, "/Wifi_Connections.json");
      
      //saveWiFicredentials( wifiCredential );
      //################################################################################################################################
      List_WiFi_Credentials_Struct temp_wifiCredentialList;
      //Load WiFiCredentialsList
      serialport.println(F("Loading WiFi configuration..."));
      serialport.println(wifiCredential.ssid);
      serialport.println(wifiCredential.pass);
      loadWiFiCredentialsList("/Wifi_Connections.json", temp_wifiCredentialList, SPIFFS);
      saveWiFiCredentialToWiFiCredentialsList(temp_wifiCredentialList, wifiCredential);
      //remove_WiFiCredential_From_WiFiCredentialsList(temp_wifiCredentialList, wifiCredential);
      saveWiFiCredentialsList("/Wifi_Connections.json", temp_wifiCredentialList, SPIFFS);
      //################################################################################################################################
      
